CopyOfRolecall_To_Fusion/Files/RoleCall_FU/Fusion/DimensionMaster/8.Run CCID Payload/Request/Request.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" 
xmlns:acc="http://xmlns.oracle.com/apps/financials/generalLedger/accounts/codeCombinations/accountCombinationService/" 
xmlns:typ="http://xmlns.oracle.com/apps/financials/generalLedger/accounts/codeCombinations/accountCombinationService/types/" 
xmlns:ns1="http://xmlns.oracle.com/apps/financials/generalLedger/accounts/codeCombinations/accountCombinationService/types/" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<typ:validateAndCreateAccounts>
			<typ:validationInputRowList>
				<acc:DynamicInsertion>Y</acc:DynamicInsertion>
				<acc:Segment1>100</acc:Segment1>
				<acc:Segment2>MgTEST016</acc:Segment2>
				<acc:Segment3>999</acc:Segment3 >
				<acc:Segment4>1171301</acc:Segment4>
				<acc:Segment5>999</acc:Segment5>
				<acc:Segment6>40009</acc:Segment6>
				<acc:Segment7>029</acc:Segment7>
				<acc:Segment8>MgCON15</acc:Segment8>
				<acc:Segment9>999</acc:Segment9>
				<acc:Segment10>999</acc:Segment10>
				<acc:Segment11>9999</acc:Segment11>
				<acc:LedgerName>SIS_COA AU</acc:LedgerName>
			</typ:validationInputRowList>
		</typ:validateAndCreateAccounts>
	</soapenv:Body>
</soapenv:Envelope>
